
class Reviews:
    """
    Сервис для добавления и получения списка отзывов.
    Получения скидки на корзину и вывода кол-ва отзывов для товара.
    """

    def add_review(self):
        """
        Добавить отзыв к товару
        """
        ...

    def all_reviews(self):
        """
        Получить список отзывов к товару
        """
        ...

    def get_discount(self):
        """
        Получить скидку на корзину
        """
        ...

    def count_of_reviews(self):
        """
        Получить кол-во отзывов для товара
        """
        ...
