# TODO: возможно реализовать сортировку через теги в шаблоне

class SortedProductsList:

    def sort_by_popularity(self):
        """ Сортировка товаров по популярности (кол-ву покупок). По убыванию """
        ...

    def reverse_sort_by_popularity(self):
        """ Сортировка товаров по популярности (кол-ву покупок). По возрастанию """
        ...

    def sort_by_price(self):
        """ Сортировка товаров по цене (по убыванию) """
        ...

    def reverse_sort_by_price(self):
        """ Сортировка товаров по цене (по возрастанию) """
        ...

    def sort_by_reviews(self):
        """ Сортировка товаров по отзывам (кол-ву отзывов). По убыванию """
        ...

    def reverse_sort_by_reviews(self):
        """ Сортировка товаров по отзывам (кол-ву отзывов). По возрастанию """
        ...

    def sort_by_novelty(self):
        """ Сортировка товаров по новизне (году выпуска). По убыванию """
        ...

    def reverse_sort_by_novelty(self):
        """ Сортировка товаров по новизне (году выпуска). По возрастанию """
        ...
